#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
environment relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/rw-test-nikhil/rw-test-nikhil/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/rw-test-nikhil/rw-test-nikhil

To view this run in a browser, visit:
https://app.terraform.io/app/rw-test/nwps-reportwriting-core-development/runs/run-RUT3GQigdiVSQ133

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cognito_user_pool.pool will be created
  + resource "aws_cognito_user_pool" "pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "reportwriting-dev"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + kms_key_id                     = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)

          + custom_email_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }

          + custom_sms_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # aws_cognito_user_pool_domain.domain will be created
  + resource "aws_cognito_user_pool_domain" "domain" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "reportwriting-dev"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # aws_security_group_rule.ecs_ecs_egress will be created
  + resource "aws_security_group_rule" "ecs_ecs_egress" {
      + description              = "Allow direct access to other containers"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_ecs_ingress will be created
  + resource "aws_security_group_rule" "ecs_ecs_ingress" {
      + description              = "Allow direct access from other containers"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.ecs_https_egress will be created
  + resource "aws_security_group_rule" "ecs_https_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Outbound https traffic"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_private_alb_ingress will be created
  + resource "aws_security_group_rule" "ecs_private_alb_ingress" {
      + description              = "Allow access from private alb"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.ecs_public_alb_ingress will be created
  + resource "aws_security_group_rule" "ecs_public_alb_ingress" {
      + description              = "Allow access from public alb"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.alb_private.aws_alb.alb will be created
  + resource "aws_alb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = true
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "reportwriting-dev-private-alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all                   = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.alb_public.aws_alb.alb will be created
  + resource "aws_alb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "reportwriting-dev-public-alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all                   = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.bridge_api.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "bridge-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all             = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
    }

  # module.bridge_api_ecs_service.data.template_file.image_template will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "image_template"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              {
                "name": "${CONTAINER_NAME}",
                "image": "${REPOSITORY_URL}:${CONTAINER_VERSION}",
                "networkMode": "awsvpc",
                "essential": true,
                "logConfiguration": {
                    "logDriver": "awslogs",
                    "options": {
                      "awslogs-group": "${LOGS_GROUP}",
                      "awslogs-region": "${AWS_REGION}",
                      "awslogs-stream-prefix": "ecs"
                    }
                },
                "portMappings": [
                  {
                    "containerPort": ${CONTAINER_PORT},
                    "hostPort": ${CONTAINER_PORT}
                  }
                ],
                "environment": ${ENVIRONMENT_VARS}
              }
            ]
        EOT
      + vars     = {
          + "AWS_REGION"        = "us-gov-west-1"
          + "CONTAINER_NAME"    = "bridge-api"
          + "CONTAINER_PORT"    = "80"
          + "CONTAINER_VERSION" = "latest"
          + "ENVIRONMENT_VARS"  = jsonencode(
                [
                  + {
                      + name  = "AUTHENTICATION__AUTHORITY"
                      + value = "https://login-test.mobility.tylertech.com/"
                    },
                  + {
                      + name  = "AUTHENTICATION__ISSUER"
                      + value = "https://login-test.mobility.tylertech.com/"
                    },
                  + {
                      + name  = "AUTHENTICATION__AUDIENCE"
                      + value = "urn:newworld"
                    },
                  + {
                      + name  = "ASPNETCORE_ENVIRONMENT"
                      + value = "Production"
                    },
                  + {
                      + name  = "LOGGING__LOGLEVEL__Nwps"
                      + value = "Trace"
                    },
                  + {
                      + name  = "BRIDGE__QUEUEFORMAT"
                      + value = "{0}-rwrest-request"
                    },
                  + {
                      + name  = "BRIDGE__HEADERS__0"
                      + value = "contract-version"
                    },
                  + {
                      + name  = "BRIDGE__HEADERS__1"
                      + value = "Authorization"
                    },
                  + {
                      + name  = "BRIDGE__HEADERS__2"
                      + value = "Content-Type"
                    },
                  + {
                      + name  = "CORS__PREFLIGHTMAXAGEHOURS"
                      + value = "24"
                    },
                  + {
                      + name  = "CORS__ALLOWEDORIGINS__0"
                      + value = "http://localhost:4200"
                    },
                  + {
                      + name  = "CORS__ALLOWEDORIGINS__1"
                      + value = "https://rwclient.nwps-dev.tylertech.cloud"
                    },
                  + {
                      + name  = "CORS__ALLOWEDMETHODS__0"
                      + value = "OPTIONS"
                    },
                  + {
                      + name  = "CORS__ALLOWEDMETHODS__1"
                      + value = "GET"
                    },
                  + {
                      + name  = "CORS__ALLOWEDMETHODS__2"
                      + value = "POST"
                    },
                ]
            )
          + "LOGS_GROUP"        = "/ecs/reportwriting-dev/bridge-api"
          + "REPOSITORY_URL"    = (known after apply)
        }
    }

  # module.bridge_api_ecs_service.aws_cloudwatch_log_group.log_group will be created
  + resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/reportwriting-dev/bridge-api"
      + retention_in_days = 30
      + tags              = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all          = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
    }

  # module.bridge_api_ecs_service.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bridge-api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bridge-api"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.bridge_api_ecs_service.aws_ecs_task_definition.task_defition will be created
  + resource "aws_ecs_task_definition" "task_defition" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "bridge-api"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.bridge_api_ecs_service.aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bridge-api_ecs-task"
      + path                  = "/"
      + tags                  = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.bridge_api_ecs_service.aws_iam_role_policy.ecs_task will be created
  + resource "aws_iam_role_policy" "ecs_task" {
      + id     = (known after apply)
      + name   = "reportwriting-dev_bridge-api_ecs_task"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sqs:DeleteMessage",
                          + "sqs:GetQueueUrl",
                          + "sqs:ReceiveMessage",
                          + "sqs:DeleteMessageBatch",
                          + "sqs:CreateQueue",
                          + "sqs:SendMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws-us-gov:sqs:us-gov-west-1:750436205735:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.bridge_api_listener.aws_alb_listener.alb_listener will be created
  + resource "aws_alb_listener" "alb_listener" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws-us-gov:acm:us-gov-west-1:750457477630:certificate/8222bad7-c371-47ea-94b6-dd09785dc9b3"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8903
      + protocol          = "HTTPS"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.bridge_api_listener.aws_alb_target_group.alb_target_group will be created
  + resource "aws_alb_target_group" "alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "bridge-api-listener"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all                           = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-299"
          + path                = "/api/health/check"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }
    }

  # module.datadog_forwarder.aws_cloudformation_stack.datadog_forwarder will be created
  + resource "aws_cloudformation_stack" "datadog_forwarder" {
      + capabilities  = [
          + "CAPABILITY_AUTO_EXPAND",
          + "CAPABILITY_IAM",
          + "CAPABILITY_NAMED_IAM",
        ]
      + id            = (known after apply)
      + name          = "reportwriting-dev-datadog-forwarder"
      + outputs       = (known after apply)
      + parameters    = (known after apply)
      + policy_body   = (known after apply)
      + tags_all      = (known after apply)
      + template_body = (known after apply)
      + template_url  = "https://datadog-cloudformation-template.s3.amazonaws.com/aws/forwarder/latest.yaml"
    }

  # module.datadog_forwarder.aws_secretsmanager_secret.dd_api_key will be created
  + resource "aws_secretsmanager_secret" "dd_api_key" {
      + arn                     = (known after apply)
      + description             = "Encrypted Datadog API Key"
      + id                      = (known after apply)
      + name                    = "datadog_api_key"
      + name_prefix             = (known after apply)
      + policy                  = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)
      + tags_all                = (known after apply)

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.datadog_forwarder.aws_secretsmanager_secret_version.dd_api_key will be created
  + resource "aws_secretsmanager_secret_version" "dd_api_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.ecs.aws_ecs_cluster.fargate will be created
  + resource "aws_ecs_cluster" "fargate" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "reportwriting-dev"
      + tags     = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ecs.aws_iam_role.ecs_task_assume will be created
  + resource "aws_iam_role" "ecs_task_assume" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "reportwriting-dev_ecs_task_execution"
      + path                  = "/"
      + tags                  = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs.aws_iam_role_policy.ecs_task_assume will be created
  + resource "aws_iam_role_policy" "ecs_task_assume" {
      + id     = (known after apply)
      + name   = "reportwriting-dev_ecs_task_execution"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.ecs_sg.aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "reportwriting-dev ecs services"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "reportwriting-dev ecs services"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev ecs services"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev ecs services"
          + "Terraform" = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.lb_public.aws_lb.lb will be created
  + resource "aws_lb" "lb" {
      + arn                              = (known after apply)
      + arn_suffix                       = (known after apply)
      + dns_name                         = (known after apply)
      + enable_cross_zone_load_balancing = true
      + enable_deletion_protection       = false
      + id                               = (known after apply)
      + internal                         = false
      + ip_address_type                  = (known after apply)
      + load_balancer_type               = "network"
      + name                             = "reportwriting-dev-public-lb"
      + security_groups                  = (known after apply)
      + subnets                          = (known after apply)
      + tags                             = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all                         = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + vpc_id                           = (known after apply)
      + zone_id                          = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.private_alb_sg.aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "reportwriting-dev private alb"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Allow access to ecs services"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow access from ecs services"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "reportwriting-dev private alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev private alb"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev private alb"
          + "Terraform" = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.public_alb_sg.aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "reportwriting-dev public alb"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Allow access to ecs services"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow access from the internet"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9000
            },
        ]
      + name                   = "reportwriting-dev public alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev public alb"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev public alb"
          + "Terraform" = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.rwservice-artifacts.aws_iam_user.deploy_user will be created
  + resource "aws_iam_user" "deploy_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "rwservice-deploy"
      + path          = "/"
      + tags          = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all      = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + unique_id     = (known after apply)
    }

  # module.rwservice-artifacts.aws_iam_user.github_user will be created
  + resource "aws_iam_user" "github_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "github-action-rwservice"
      + path          = "/"
      + tags          = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all      = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + unique_id     = (known after apply)
    }

  # module.rwservice-artifacts.aws_iam_user_policy.s3_ro will be created
  + resource "aws_iam_user_policy" "s3_ro" {
      + id     = (known after apply)
      + name   = "rwservice-artifacts-ro"
      + policy = (known after apply)
      + user   = "rwservice-deploy"
    }

  # module.rwservice-artifacts.aws_iam_user_policy.s3_rw will be created
  + resource "aws_iam_user_policy" "s3_rw" {
      + id     = (known after apply)
      + name   = "rwservice-artifacts-rw"
      + policy = (known after apply)
      + user   = "github-action-rwservice"
    }

  # module.rwservice-artifacts.aws_s3_bucket.s3 will be created
  + resource "aws_s3_bucket" "s3" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "rwservice-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.rwservice-artifacts.aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + queue {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_suffix = "artifacts.zip"
          + id            = (known after apply)
          + queue_arn     = (known after apply)
        }
    }

  # module.rwservice-artifacts.aws_sqs_queue.queue will be created
  + resource "aws_sqs_queue" "queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "rwservice-upload-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all                          = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.rwservice-artifacts.aws_sqs_queue_policy.queue_policy will be created
  + resource "aws_sqs_queue_policy" "queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.vpc.aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev elastic ip"
          + "Terraform" = "true"
        }
      + tags_all             = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev elastic ip"
          + "Terraform" = "true"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.ig will be created
  + resource "aws_internet_gateway" "ig" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev internet gateway"
          + "Terraform" = "true"
        }
      + tags_all = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev internet gateway"
          + "Terraform" = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev nat gateway"
          + "Terraform" = "true"
        }
      + tags_all             = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev nat gateway"
          + "Terraform" = "true"
        }
    }

  # module.vpc.aws_route.private will be created
  + resource "aws_route" "private" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev private route table"
          + "Terraform" = "true"
        }
      + tags_all         = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev private route table"
          + "Terraform" = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev public route table"
          + "Terraform" = "true"
        }
      + tags_all         = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev public route table"
          + "Terraform" = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Default security group to allow inbound/outbound from the VPC"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "reportwriting-dev-default-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev default security group"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev default security group"
          + "Terraform" = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-gov-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "private reportwriting-dev subnet"
          + "Terraform" = "true"
        }
      + tags_all                        = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "private reportwriting-dev subnet"
          + "Terraform" = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-gov-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "private reportwriting-dev subnet"
          + "Terraform" = "true"
        }
      + tags_all                        = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "private reportwriting-dev subnet"
          + "Terraform" = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-gov-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "public reportwriting-dev subnet"
          + "Terraform" = "true"
        }
      + tags_all                        = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "public reportwriting-dev subnet"
          + "Terraform" = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-gov-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.102.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "public reportwriting-dev subnet"
          + "Terraform" = "true"
        }
      + tags_all                        = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "public reportwriting-dev subnet"
          + "Terraform" = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev vpc"
          + "Terraform" = "true"
        }
      + tags_all                         = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Name"      = "reportwriting-dev vpc"
          + "Terraform" = "true"
        }
    }

  # module.authorizer.module.authorizer.aws_cloudwatch_log_group.distributor will be created
  + resource "aws_cloudwatch_log_group" "distributor" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/reportwriting-dev-gateway-authorizer"
      + retention_in_days = 3
      + tags              = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all          = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
    }

  # module.authorizer.module.authorizer.aws_iam_role.authorizer will be created
  + resource "aws_iam_role" "authorizer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "apigateway.amazonaws.com",
                              + "lambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "reportwriting-dev-gateway-authorizer-role"
      + path                  = "/"
      + tags                  = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.authorizer.module.authorizer.aws_iam_role_policy.dynamodb will be created
  + resource "aws_iam_role_policy" "dynamodb" {
      + id     = (known after apply)
      + name   = "dynamodb-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.authorizer.module.authorizer.aws_iam_role_policy.invoke_lambda will be created
  + resource "aws_iam_role_policy" "invoke_lambda" {
      + id     = (known after apply)
      + name   = "lambda-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.authorizer.module.authorizer.aws_iam_role_policy_attachment.authorizer_basic will be created
  + resource "aws_iam_role_policy_attachment" "authorizer_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-us-gov:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.authorizer.module.authorizer.aws_lambda_function.authorizer will be created
  + resource "aws_lambda_function" "authorizer" {
      + arn                            = (known after apply)
      + function_name                  = "reportwriting-dev-gateway-authorizer"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = "authorizertest"
      + s3_key                         = "nwps-gateway-authorizer/authorizer/authorizer.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all                       = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.authorizer.module.policy.aws_dynamodb_table.policy will be created
  + resource "aws_dynamodb_table" "policy" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "apiId"
      + id               = (known after apply)
      + name             = "reportwriting-dev-gateway-authorizer-policy"
      + range_key        = "subjectId"
      + read_capacity    = 2
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + tags_all         = {
          + "App_Name"  = "reportwriting-dev"
          + "Component" = "nwps report writing"
          + "Terraform" = "true"
        }
      + write_capacity   = 1

      + attribute {
          + name = "apiId"
          + type = "S"
        }
      + attribute {
          + name = "subjectId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

Plan: 59 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_private     = (known after apply)
  + alb_dns_public      = (known after apply)
  + cognito_userpool_id = (known after apply)
  + lb_dns_public       = (known after apply)

Warning: Interpolation-only expressions are deprecated

  on ../modules/compute/ecs/service/main.tf line 47, in data "template_file" "image_template":
  47:   template = "${file("${path.module}/image.json.tpl")}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 15 more similar warnings elsewhere)

```
</details>
*Pusher: @nikhil-lfc, Action: `pull_request`*